# Pandas

Pandas is a tool fopr data processing which helps in data analysis

It provides functions and methods to efficiently manipulate large datasets

-  `Series` is a one-dimensional array with labels it can contain nay data type including integers, strings, floats, Python objects, etc.
-  `DataFrame` is a two-dimensional array with labels for rows and columns. We can use labels to locate data

In [30]:
import pandas as pd

In [31]:
# check pandas version
pd.__version__

'2.2.1'

# Series create, manipulate, querry, delete

In [32]:
# creating a series from a list
arr = [1, 2, 3, 4, 5]
s1 = pd.Series(arr)
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [33]:
order = [1, 2, 3, 4, 5]
s2 = pd.Series(arr, index=order)
s2

1    1
2    2
3    3
4    4
5    5
dtype: int64

In [34]:
import numpy as np
n = np.random.randn(5)  # Create a random Ndarray
index = ['a', 'b', 'c', 'd', 'e']
s3 = pd.Series(n, index=index)
s3

a    0.842131
b    1.779304
c   -1.018268
d   -1.554492
e   -0.296816
dtype: float64

In [35]:
# create Serues from dictionary
d = {'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}
s4 = pd.Series(d)
s4

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [36]:
# modify the index of series
print(s1)
s1.index = ['A', 'B', 'C', 'D', 'E']
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [37]:
# slicing
s1[-2:]

D    4
E    5
dtype: int64

In [38]:
s5 = pd.concat([s1, s3])  # instead of concatenate, we can use append
s5

A    1.000000
B    2.000000
C    3.000000
D    4.000000
E    5.000000
a    0.842131
b    1.779304
c   -1.018268
d   -1.554492
e   -0.296816
dtype: float64

In [39]:
s5.drop('e')  # doesn't change the original series

A    1.000000
B    2.000000
C    3.000000
D    4.000000
E    5.000000
a    0.842131
b    1.779304
c   -1.018268
d   -1.554492
dtype: float64

In [40]:
s5

A    1.000000
B    2.000000
C    3.000000
D    4.000000
E    5.000000
a    0.842131
b    1.779304
c   -1.018268
d   -1.554492
e   -0.296816
dtype: float64

# Series operations

In [41]:
arr1 = [0, 1, 2, 3, 4, 5, 7]
arr2 = [6, 7, 8, 9, 5]

In [42]:
s6  = pd.Series(arr2)
s6

0    6
1    7
2    8
3    9
4    5
dtype: int64

In [43]:
s7 = pd.Series(arr1)
s7

0    0
1    1
2    2
3    3
4    4
5    5
6    7
dtype: int64

In [44]:
s6.add(s7)

0     6.0
1     8.0
2    10.0
3    12.0
4     9.0
5     NaN
6     NaN
dtype: float64

In [45]:
s6.sub(s7)

0    6.0
1    6.0
2    6.0
3    6.0
4    1.0
5    NaN
6    NaN
dtype: float64

In [46]:
s6.mul(s7)

0     0.0
1     7.0
2    16.0
3    27.0
4    20.0
5     NaN
6     NaN
dtype: float64

In [47]:
s6.div(s7)

0     inf
1    7.00
2    4.00
3    3.00
4    1.25
5     NaN
6     NaN
dtype: float64

In [48]:
print('median', s7.median())
print('max', s7.max())
print('min', s7.min())
print('mean', s7.mean())
print('sum', s7.sum())
print('std', s7.std())
print('count', s7.count())

median 3.0
max 7
min 0
mean 3.142857142857143
sum 22
std 2.410295378065479
count 7

In [49]:
# invalid values are ignored
s8 = s6.div(s7)
print('median', s8.median())
print('max', s8.max())
print('min', s8.min())
print('mean', s8.mean())
print('sum', s8.sum())
# print('std', s8.std())
print('count', s8.count())

median 4.0
max inf
min 1.25
mean inf
sum inf
count 5

# Create DataFrame

In [50]:
dates = pd.date_range('today', periods=6)  # Define time sequence as index
dates

DatetimeIndex(['2024-04-20 13:05:49.341765', '2024-04-21 13:05:49.341765',
               '2024-04-22 13:05:49.341765', '2024-04-23 13:05:49.341765',
               '2024-04-24 13:05:49.341765', '2024-04-25 13:05:49.341765'],
              dtype='datetime64[ns]', freq='D')

In [51]:
num_arr = np.random.randn(6,4)  # Create a numpy random array
num_arr

array([[-1.01811908,  1.02421034, -1.29556034, -0.57511355],
       [ 0.75445658, -0.6579842 , -1.00050237,  0.46034704],
       [-0.51852879, -1.20841365, -0.23799618, -0.54631701],
       [ 0.71575504,  0.05589349,  0.28724537, -0.57800137],
       [-1.17397824,  0.57128189, -0.02838304,  0.98925697],
       [-0.87149217, -0.67218881, -0.72790351,  1.48441834]])

In [52]:
columns = ['A', 'B', 'C', 'D']  # Create a list of column names
columns

['A', 'B', 'C', 'D']

In [53]:
df1 = pd.DataFrame(num_arr, index=dates.map(lambda x: x.strftime('%Y-%m-%d'))
, columns=columns)
df1

                   A         B         C         D
2024-04-20 -1.018119  1.024210 -1.295560 -0.575114
2024-04-21  0.754457 -0.657984 -1.000502  0.460347
2024-04-22 -0.518529 -1.208414 -0.237996 -0.546317
2024-04-23  0.715755  0.055893  0.287245 -0.578001
2024-04-24 -1.173978  0.571282 -0.028383  0.989257
2024-04-25 -0.871492 -0.672189 -0.727904  1.484418

In [54]:
# create dataframes with dictionary array

data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df2 = pd.DataFrame(data, index=labels)
df2

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [55]:
# see datatypes
df2.dtypes

animal       object
age         float64
visits        int64
priority     object
dtype: object

In [56]:
df3 = df2.head(10)
df3

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [57]:
df2.tail(3)

  animal  age  visits priority
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [59]:
print(df2.index)
df2.columns

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

Index(['animal', 'age', 'visits', 'priority'], dtype='object')

In [60]:
df2.values

array([['cat', 2.5, 1, 'yes'],
       ['cat', 3.0, 3, 'yes'],
       ['snake', 0.5, 2, 'no'],
       ['dog', nan, 3, 'yes'],
       ['dog', 5.0, 2, 'no'],
       ['cat', 2.0, 3, 'no'],
       ['snake', 4.5, 1, 'no'],
       ['cat', nan, 1, 'yes'],
       ['dog', 7.0, 2, 'no'],
       ['dog', 3.0, 1, 'no']], dtype=object)

In [61]:
df2.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

## Manipulate Data

In [63]:
df1.T # transpose the dataframe

   2024-04-20  2024-04-21  2024-04-22  2024-04-23  2024-04-24  2024-04-25
A   -1.018119    0.754457   -0.518529    0.715755   -1.173978   -0.871492
B    1.024210   -0.657984   -1.208414    0.055893    0.571282   -0.672189
C   -1.295560   -1.000502   -0.237996    0.287245   -0.028383   -0.727904
D   -0.575114    0.460347   -0.546317   -0.578001    0.989257    1.484418

In [64]:
df2.sort_values(by='age')

  animal  age  visits priority
c  snake  0.5       2       no
f    cat  2.0       3       no
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no
g  snake  4.5       1       no
e    dog  5.0       2       no
i    dog  7.0       2       no
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [65]:
# slicing dataframe
df2[1:3]

  animal  age  visits priority
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [66]:
#  query dataframe by tag
df2[['age', 'visits']]

   age  visits
a  2.5       1
b  3.0       3
c  0.5       2
d  NaN       3
e  5.0       2
f  2.0       3
g  4.5       1
h  NaN       1
i  7.0       2
j  3.0       1

In [67]:
df2.sort_values(by='age')[1:3]

  animal  age  visits priority
f    cat  2.0       3       no
a    cat  2.5       1      yes

In [70]:
# query dataframe by tag
df2[['age', 'visits']]

   age  visits
a  2.5       1
b  3.0       3
c  0.5       2
d  NaN       3
e  5.0       2
f  2.0       3
g  4.5       1
h  NaN       1
i  7.0       2
j  3.0       1

In [71]:
df2.iloc[1:3]  # query dataframe by index (rows) 2, 3

  animal  age  visits priority
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [72]:
df3 = df2.copy()
df3

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [75]:
df3.isnull()

   animal    age  visits  priority
a   False  False   False     False
b   False  False   False     False
c   False  False   False     False
d   False   True   False     False
e   False  False   False     False
f   False  False   False     False
g   False  False   False     False
h   False   True   False     False
i   False  False   False     False
j   False  False   False     False

In [77]:
df3.loc['f', 'age'] = 1.5  # changes value of row 'f' and column 'age'
df3

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [80]:
df3[['age']].mean()

age    3.375
dtype: float64

In [83]:
# exclude non-numeric columns
numeric_columns = df3.select_dtypes(include=['int64', 'float64']).columns
mean_numeric = df3[numeric_columns].mean()
mean_numeric

age       3.375
visits    1.900
dtype: float64

In [88]:
df3['visits'].sum()

19

In [89]:
df3.sum()

animal      catcatsnakedogdogcatsnakecatdogdog
age                                       27.0
visits                                      19
priority              yesyesnoyesnononoyesnono
dtype: object

In [92]:
string = pd.Series(['A', 'C', 'D', 'Aaa', 'BaCa', np.nan, 'CBA', 'cow', 'owl'])
string.str.lower()

0       a
1       c
2       d
3     aaa
4    baca
5     NaN
6     cba
7     cow
8     owl
dtype: object

In [93]:
string.str.lower()

0       a
1       c
2       d
3     aaa
4    baca
5     NaN
6     cba
7     cow
8     owl
dtype: object

# Operations for DataFrame missing values

In [97]:
df4 = df3.copy()
df4.fillna(4)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  4.0       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  4.0       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [98]:
mean_age = df4['age'].mean()
df4['age'].fillna(mean_age)

a    2.500
b    3.000
c    0.500
d    3.375
e    5.000
f    1.500
g    4.500
h    3.375
i    7.000
j    3.000
Name: age, dtype: float64

In [100]:
df5 = df3.copy()
df5.dropna(how='any')

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
i    dog  7.0       2       no
j    dog  3.0       1       no

# Dataframe file operations

In [102]:
# df3.to_csv('animals.csv')

In [103]:
df_animal = pd.read_csv('animals.csv')
df_animal.head(3)

  Unnamed: 0 animal  age  visits priority
0          a    cat  2.5       1      yes
1          b    cat  3.0       3      yes
2          c  snake  0.5       2       no

In [107]:
!pip install openpyxl
import openpyxl

1371.11s - pydevd: Sending message related to process being replaced timed-out after 5 seconds
Requirement already satisfied: openpyxl in /home/tom/anaconda3/envs/python312/lib/python3.12/site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in /home/tom/anaconda3/envs/python312/lib/python3.12/site-packages (from openpyxl) (1.1.0)

In [111]:
df3.to_excel ('animal.xlsx', sheet_name='Sheet1')
df_animal2 = pd.read_excel('animal.xlsx', 'Sheet1', index_col=False, na_values=['NA'])
df_animal2

  Unnamed: 0 animal  age  visits priority
0          a    cat  2.5       1      yes
1          b    cat  3.0       3      yes
2          c  snake  0.5       2       no
3          d    dog  NaN       3      yes
4          e    dog  5.0       2       no
5          f    cat  1.5       3       no
6          g  snake  4.5       1       no
7          h    cat  NaN       1      yes
8          i    dog  7.0       2       no
9          j    dog  3.0       1       no